Revit 2027 API
MultiReferenceAnnotationType.ReferenceCategoryId Property
 The category of elements to which this annotation applies.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId ReferenceCategoryId { get; }
Public ReadOnly Property ReferenceCategoryId As ElementId
	Get
public:
property ElementId^ ReferenceCategoryId {
	ElementId^ get ();
}
member ReferenceCategoryId : ElementId with get
Property Value
ElementId
Remarks
 The TagTypeId will be cleared because the user must set a new tag type of an appropriate category.
See Also
Reference
MultiReferenceAnnotationType Class
Autodesk.Revit.DB Namespace